/*******************************************************************************
 *  @file      UserConfig.h 2013\1\9 17:21:07 $
 *  @author    Wang Xiaotao<wangxiaotao1980@snda.com>
 *  用户自定设定
 ******************************************************************************/

#ifndef USERCONFIG_3E5FC46C_B15D_46C3_9D9F_B083DFFCA247_H__
#define USERCONFIG_3E5FC46C_B15D_46C3_9D9F_B083DFFCA247_H__

/******************************************************************************/
// todo : 用户自己加入自定义设定

// 编译成动态连接库的时候，需要定义如下宏
// #define CPS_ALL_DYNAMIC_LINK
// 编译成静态接库的时候，需要定义如下宏
// #define CPS_ALL_STATIC_LINK


/******************************************************************************/
#endif// USERCONFIG_3E5FC46C_B15D_46C3_9D9F_B083DFFCA247_H__
